1.前面的jupyter lab安装使用和visual studio code的安装使用其实对新手来说是比较困难的，好在有谷歌，每次都是谷歌一会儿就能解决问题。比如如何用jupyter打开本地文件。
2.git的使用学习也需要耐心，得一两天时间吧，多操作玩一玩就知道了。主要阅读github里的guide和git Book里的第二章。
3.整本书的使用和学习必须搭梯子，否则会出现各种各样的问题，比如仓库download不下来，书中图片不显示等等等等。
4.我还算有点基础的，学过learn python the hard way, codeacademy python等等，但对纯小白来说，书里的有些内容我预计难度是挺大的，需要更加耐心了。

我的学习记录：
一、第一遍： 5月1日～5月16日
用了2周时间，目前第一遍已经学完，基本是粗读一遍，把全部代码自己手动打了一遍有个初步了解。
二、第二遍：
第二遍是准备精读，包括python官方文档也准备认真读一遍，预算是1个月时间，读的时候按照老师的说法做做笔记。

三、学习用python操作office和邮件，进行简单的自动化办公练习。
四、把玩github上牛掰的python项目。